In [1]:
import numpy as np
import pandas as pd

In [3]:
# Задание 1
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']}, 
                       columns=['author_id', 'author_name'])

In [4]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [5]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title': 
                     ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                      'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                   'price': [450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price'])

In [6]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [11]:
# Задание 2
#Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.
author_price = pd.merge(authors, book, on = 'author_id', how = 'left')

In [12]:
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [20]:
# Задание 3
# Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [18]:
top5 = author_price[['price', 'book_title']]

In [19]:
top5.nlargest(5, 'price')

   price         book_title
3    500   Толстый и тонкий
0    450        Отцы и дети
4    450    Дама с собачкой
5    370              Гроза
2    350  Дворянское гнездо

In [33]:
# Задание 4
# Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
#author_name, min_price, max_price и mean_price, в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.
df1 = author_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'})
df2 = author_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'})
df3 = author_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'})
authors_stat=pd.concat([df1, df2, df3], axis = 1)
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000